app/controllers/customers_controller.rb

SELECT "customers".* FROM "customers"
---
  def index
    @user = Customer.all

SELECT "customers".* FROM "customers" WHERE "customers"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def show
    @user = Customer.find(params[:id])