app/controllers/employees_controller.rb

INSERT INTO "employees" ("created_at", "name", "salary", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Sat, 05 Apr 2014 11:39:47 UTC +00:00], ["name", "Shaikh Imran"], ["salary", 35000], ["updated_at", Sat, 05 Apr 2014 11:39:47 UTC +00:00]]
---
  def create
    @employee = Employee.new(params[:employee])
    respond_to do |format|
      if @employee.save

SELECT "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def update
    @employee = Employee.find(params[:id])